Revit 2020 API
GeometryObject Properties
The GeometryObject type exposes the following members.
Properties
Name | Description
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Visibility
The visibility.
See Also
GeometryObject Class
Autodesk.Revit.DB Namespace